{
	"leadership":[
		{
			"title":"HackNA",
			"richMedia":{
				"src":"https://akshathjain.com/HackNA/2017/images/logo.svg",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"After noticing a lack of introductory computer science opportunities and programming competitions in the Pittsburgh area, a friend and I co-founded HackNA—a twelve-hour hackathon taking place at my high school. Hackathons are great ways to introduce more people to computer science and robotics—teams have twelve hours to design, develop, and build software or hardware hacks (e.g. websites, robots, Android/iOS apps) on site and compete to win sponsored prizes and awards. The event, on December 16, 2017, brought together over 200 community members from more than 25 school districts across Pittsburgh, including 15 companies and 5 sponsors in order to foster a high school tech community. <br><br> The event was specifically designed so that absolutely no prior experience was necessary! We coordinated with local companies who sent professionals to help mentor teams, judge projects, and teach workshops ranging from “Intro to Programming” to “Android Development”—all to help beginners get started and experts excel. <br><br> In fact, after receiving an overwhelming amount of positive community support and feedback, we decided to host a “mini” version of HackNA later this year in May specifically for beginners and middle school students."
				},
				{
					"title":"Date",
					"content":"December 16, 2017"
				},
				{
					"title":"Location",
					"content":"North Allegheny Senior High School"
				},
				{
					"title":"Community Outreach",
					"content":"Over 200 people"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"https://hackna.org"
				},
				{
					"title":"Trib Live Article",
					"link":"http://triblive.com/local/northhills/13088220-74/hackna-designed-to-challenge-middle-high-school-students"
				},
				{
					"title":"NASH Uproar Article",
					"link":"https://nashuproar.org/5351/news/can-hack-it/"
				}
			]
		},
		{
			"title":"Code One",
			"richMedia": {
				"src":"https://projectcodeone.org/assets/favicon.png",
				"type":"icon"
			},	
			"info":[
				{
					"title":"Description",
					"content":"After competing in numerous computer science and STEM-related events around my community, I noticed that not everyone was represented—many people were lacking the resources to beginning exploring as I did. In response, I founded Code One, an organization centered around increasing computer science exposure in my community. Partnered with Millvale Community Library, Code One organizes programming lessons in public locations every week after school for middle and high school students. Lessons first begin with Scratch, a simple drag and drop programming language designed to familiarize students with computer logic, and then progress onto Python, a versatile language with easy-to-learn syntax."
				},
				{
					"title":"Number of Sessions",
					"content":"Between 8 and 10"
				},
				{
					"title":"Number of Students",
					"content":"Between 5 and 15"
				},
				{
					"title":"Number of Instructors",
					"content":"3 instructors per session"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"https://projectcodeone.org"
				}
			]
		},
		{
			"title":"Cross Country",
			"richMedia":{
				"src":"https://pbs.twimg.com/profile_images/804065777020260355/7LEe2rO3.jpg",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"As a runner for my school’s Cross Country team for three years, I became Varsity Co-Captain of the boy’s team this past season. My responsibilities as Co-Captain included leading almost a hundred teammates during practice and meets as well as helping newer members of the team become accustomed to the intense workload the sport carries."
				},
				{
					"title":"Years on the team",
					"content":"3 years"
				},
				{
					"title":"Number of runners",
					"content":"79 runners"
				}
			]	

		},
		{
			"title":"Leap@CMU Teaching Assistant",
			"richMedia":{
				"src":"https://www.cs.cmu.edu/~leap/rotatingimg/leapbig2_08.jpg",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"Leap@CMU is an intensive, seven-week summer camp for high school students. Held at Carnegie Mellon University, Leap allows students to explore computer science and mathematics in a fun and engaging environment. After participating in 2015, I returned as a Teaching Assistant (TA) in 2016 and 2017. As a TA, I directed and taught the Intermediate Programming track, which based in Java, explored concepts ranging from Object Oriented Programming and Recursion to Machine Learning and Data Mining."
				},
				{
					"title":"Location",
					"content":"Carnegie Mellon University"
				},
				{
					"title":"Number of Students",
					"content":"Approximately 40"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"https://www.cs.cmu.edu/~leap"
				},
				{
					"title":"View Curriculum",
					"link":"https://github.com/akshathjain/Leap2017"
				}
			]
		},
		{
			"title":"Pittsburgh Forensics Institute",
			"richMedia":{
				"src":"https://akshathjain.com/PFIWebsite/images/gavel.png",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"During the summer of 2017, I was elected to be an organizer for Pittsburgh Forensics Institute (PFI). Held at the University of Pittsburgh, PFI is a summer Speech & Debate camp open to all middle and high school students in the Greater Pittsburgh Area. My role as organizer included key responsibilities such as creating a website, marketing, communicating with Pitt, coordinating instructors, and teaching Public Forum Debate. Intended to serve as a fundraiser for my team’s Speech & Debate team, PFI helped raise nearly $15,000 this past summer!"
				},
				{
					"title":"Dates",
					"content":"July 31, 2017 to August 11, 2017"
				},
				{
					"title":"Location",
					"content":"University of Pittsburgh"
				},
				{
					"title":"Number of Students",
					"content":"Approximately 50"
				}
			],
			"buttons":[
				{
					"title":"Visit Webiste",
					"link":"https://pghforensics.org"
				}
			]
		},
		{
			"title":"Hour of Code",
			"richMedia":{
				"src":"https://www.youtube.com/embed/0CaICfJ9OLQ",
				"type":"video"
			},
			"info":[
				{
					"title":"Description",
					"content":"During my freshman year of high school, I helped organize and direct the Hour of Code event at my school on December 11, 2014. Bringing together 432 students, this event encouraged more participation in computer science by allowing participants to take time off class to learn to code through Code.org."
				},
				{
					"title":"Date",
					"content":"December 11, 2014"
				},
				{
					"title":"Location",
					"content":"North Allegheny Intermediate High School"
				},
				{
					"title":"Number of Participants",
					"content":"432 students"
				}
			],
			"buttons":[]
		}
	]
}
