{
	"leadership":[
		{
			"title":"HackNA",
			"richMedia":{
				"src":"http://akshathjain.com/HackNA/images/logo.svg",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"After noticing a lack of introductory computer science opportunities and programming competitions in the Pittsburgh area, a friend and I co-founded HackNA—a twelve-hour school hackathon taking place at my high school. A hackathon is a competition during which teams design, develop, and build software or hardware hacks (e.g. websites, robots, Android/iOS apps) on site and compete to win sponsored prizes and awards. The event, on December 16, 2017, plans on bringing together about 350 middle and high school students from schools across Pittsburgh in order to foster a high school tech community. Moreover, the event is designed so that absolutely no prior experience is necessary! We’ll be providing mentor expertise and optional workshops to help beginners get started and experts excel."
				},
				{
					"title":"Number of participants",
					"content":"We expect between 300 and 350"
				},
				{
					"title":"Date",
					"content":"December 16, 2017"
				},
				{
					"title":"Location",
					"content":"North Allegheny Senior High School"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"http://hackna.org"
				}
			]
		},
		{
			"title":"Code One",
			"richMedia": {
				"src":"http://projectcodeone.org/assets/favicon.png",
				"type":"icon"
			},	
			"info":[
				{
					"title":"Description",
					"content":"After competing in numerous computer science and STEM-related events around my community, I noticed that not everyone was represented—many people were lacking the resources to beginning exploring as I did. In response, I founded Code One, an organization centered around increasing computer science exposure in my community. Partnered with Millvale Community Library, Code One organizes programming lessons in public locations every week after school for middle and high school students. Lessons first begin with Scratch, a simple drag and drop programming language designed to familiarize students with computer logic, and then progress onto Python, a versatile language with easy-to-learn syntax."
				},
				{
					"title":"Number of Sessions",
					"content":"Between 8 and 10"
				},
				{
					"title":"Number of Students",
					"content":"Between 5 and 15"
				},
				{
					"title":"Number of Instructors",
					"content":"3 instructors per session"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"http://projectcodeone.org"
				}
			]
		},
		{
			"title":"Leap@CMU Teaching Assistant",
			"richMedia":{
				"src":"https://www.cs.cmu.edu/~leap/rotatingimg/leapbig2_08.jpg",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"Leap@CMU is an intensive, seven-week summer camp for high school students. Held at Carnegie Mellon University, Leap allows students to explore computer science and mathematics in a fun and engaging environment. After participating in 2015, I returned as a Teaching Assistant (TA) in 2016 and 2017. As a TA, I directed and taught the Intermediate Programming track, which based in Java, explored concepts ranging from Object Oriented Programming and Recursion to Machine Learning and Data Mining."
				},
				{
					"title":"Location",
					"content":"Carnegie Mellon University"
				},
				{
					"title":"Number of Students",
					"content":"Approximately 40"
				}
			],
			"buttons":[
				{
					"title":"Visit Website",
					"link":"https://www.cs.cmu.edu/~leap"
				},
				{
					"title":"View Curriculum",
					"link":"https://github.com/akshathjain/Leap2017"
				}
			]
		},
		{
			"title":"Pittsburgh Forensics Institute",
			"richMedia":{
				"src":"http://akshathjain.com/PFIWebsite/images/gavel.png",
				"type":"icon"
			},
			"info":[
				{
					"title":"Description",
					"content":"During the summer of 2017, I was elected to be an organizer for Pittsburgh Forensics Institute (PFI). Held at the University of Pittsburgh, PFI is a summer Speech & Debate camp open to all middle and high school students in the Greater Pittsburgh Area. My role as organizer included key responsibilities such as creating a website, marketing, communicating with Pitt, coordinating instructors, and teaching Public Forum Debate. Intended to serve as a fundraiser for my team’s Speech & Debate team, PFI helped raise nearly $15,000 this past summer!"
				},
				{
					"title":"Location",
					"content":"University of Pittsburgh"
				},
				{
					"title":"Number of Students",
					"content":"Approximately 50"
				}
			],
			"buttons":[
				{
					"title":"Visit Webiste",
					"link":"http://pghforensics.org"
				}
			]
		},
		{
			"title":"Hour of Code",
			"richMedia":{
				"src":"https://www.youtube.com/embed/0CaICfJ9OLQ",
				"type":"video"
			},
			"info":[
				{
					"title":"Description",
					"content":"During my freshman year of high school, I helped organize and direct the Hour of Code event at my school on December 11, 2014. Bringing together 432 students, this event encouraged more participation in computer science by allowing participants to take time off class to learn to code through Code.org."
				},
				{
					"title":"Date",
					"content":"December 11, 2014"
				},
				{
					"title":"Location",
					"content":"North Allegheny Intermediate High School"
				},
				{
					"title":"Number of participants",
					"content":"432 Students"
				}
			],
			"buttons":[]
		}
	]
}
